app/controllers/api/photos_controller.rb

INSERT INTO "photos" ("title", "user_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "first post "], ["user_id", 3], ["description", "ssssssssssssssss"], ["created_at", "2020-10-14 23:25:04.909131"], ["updated_at", "2020-10-14 23:25:04.909131"]]
---
    def create
        photo = Photo.new(photo_params)
        if photo.save