app/models/user.rb

    def self.find_by_credentials(username, password)
        user = self.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "fakeuser"], ["LIMIT", 1]]

    def reset_session_token
        self.session_token = SecureRandom.urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "sPNqmFRKy4Wt-fvd4r2KvQ"], ["updated_at", "2020-08-20 21:12:42.262112"], ["id", 1]]